---
kind: other
id: Methods.T:Autodesk.Revit.DB.ReferenceIntersector
zh: 射线、射线相交
source: html/a69f4b5a-be11-2ac8-9a86-85f0a04b6aca.htm
---
# ReferenceIntersector Methods

**中文**: 射线、射线相交

Projects a ray from the origin along the given direction, and returns all references from intersected elements which match the ReferenceIntersector's criteria.